## SQL Practices

In [1]:
# Load Magic commands
import sqlite3
%load_ext sql

# Load SQLite database
%sql sqlite:///pandp.db

In [2]:
%%sql
SELECT name tables
FROM sqlite_master 
WHERE type IN ('table','view') AND name NOT LIKE 'sqlite_%' 
ORDER BY 1;

 * sqlite:///pandp.db
Done.

[('accounts',), ('orders',), ('region',), ('sales_reps',), ('web_events',)]

### order by

In [3]:
%%sql
SELECT id, account_id, total_amt_usd
FROM orders
ORDER BY account_id, total_amt_usd DESC
limit 5;

 * sqlite:///pandp.db
Done.

[(4308, 1001, 9426.71),
 (4309, 1001, 9230.67),
 (4316, 1001, 9134.31),
 (4317, 1001, 8963.91),
 (4314, 1001, 8863.24)]

In [4]:
%%sql
SELECT id, account_id, total_amt_usd
FROM orders
ORDER BY total_amt_usd DESC, account_id
limit 5;

 * sqlite:///pandp.db
Done.

[(4016, 4251, 232207.07),
 (3892, 4161, 112875.18),
 (3963, 4211, 107533.55),
 (5791, 2861, 95005.82),
 (3778, 4101, 93547.84)]

### where

In [5]:
%%sql
SELECT *
FROM orders
WHERE account_id = 4251
ORDER BY occurred_at
LIMIT 1000;

 * sqlite:///pandp.db
Done.

[(6719, 4251, '2016-06-05 01:16:37', 0, 78, 0, 78, 0, 584.22, 0, 584.22),
 (4009, 4251, '2016-06-05 01:36:42', 626, 15, 0, 641, 3123.74, 112.35, 0, 3236.09),
 (4010, 4251, '2016-07-04 12:34:49', 498, 6, 2, 506, 2485.02, 44.94, 16.24, 2546.2),
 (4011, 4251, '2016-08-02 00:53:28', 679, 36, 5, 720, 3388.21, 269.64, 40.6, 3698.45),
 (6720, 4251, '2016-08-02 01:13:08', 9, 0, 19, 28, 44.91, 0, 154.28, 199.19),
 (4012, 4251, '2016-09-01 02:32:51', 503, 13, 32, 548, 2509.97, 97.37, 259.84, 2867.18),
 (6721, 4251, '2016-09-01 02:39:55', 3, 71, 50, 124, 14.97, 531.79, 406, 952.76),
 (4013, 4251, '2016-09-30 13:31:53', 503, 39, 0, 542, 2509.97, 292.11, 0, 2802.08),
 (4014, 4251, '2016-10-29 12:04:06', 483, 12, 0, 495, 2410.17, 89.88, 0, 2500.05),
 (6722, 4251, '2016-11-27 15:16:07', 19, 56, 0, 75, 94.81, 419.44, 0, 514.25),
 (4015, 4251, '2016-11-27 15:17:06', 520, 21, 7, 548, 2594.8, 157.29, 56.84, 2808.93),
 (6723, 4251, '2016-12-26 08:39:56', 0, 31, 21, 52, 0, 232.19, 170.52, 402.71),
 (4016, 4251, '2016-12-26 08:53:24', 521, 16, 28262, 28799, 2599.79, 119.84, 229487.44, 232207.07)]

In [6]:
%%sql
SELECT *
FROM orders
WHERE gloss_amt_usd >= 1000
LIMIT 5;

 * sqlite:///pandp.db
Done.

[(14, 1001, '2016-10-26 20:31:30', 97, 143, 54, 294, 484.03, 1071.07, 438.48, 1993.58),
 (62, 1091, '2014-10-13 12:12:55', 146, 196, 3, 345, 728.54, 1468.04, 24.36, 2220.94),
 (88, 1101, '2015-06-24 13:08:15', 182, 339, 17, 538, 908.18, 2539.11, 138.04, 3585.33),
 (121, 1131, '2016-08-10 23:47:41', 273, 134, 0, 407, 1362.27, 1003.66, 0, 2365.93),
 (129, 1141, '2016-12-21 15:52:58', 143, 1045, 2157, 3345, 713.57, 7827.05, 17514.84, 26055.46)]

In [7]:
%%sql
SELECT *
FROM orders
WHERE total_amt_usd < 500
LIMIT 10;

 * sqlite:///pandp.db
Done.

[(67, 1091, '2015-04-07 13:29:20', 95, 0, 0, 95, 474.05, 0, 0, 474.05),
 (96, 1101, '2016-03-15 11:36:03', 14, 8, 16, 38, 69.86, 59.92, 129.92, 259.7),
 (119, 1131, '2016-06-12 12:29:45', 0, 30, 23, 53, 0, 224.7, 186.76, 411.46),
 (124, 1131, '2016-11-07 05:10:56', 0, 0, 0, 0, 0, 0, 0, 0),
 (254, 1251, '2014-11-01 02:15:24', 0, 0, 17, 17, 0, 0, 138.04, 138.04),
 (328, 1291, '2015-08-03 08:35:23', 0, 19, 21, 40, 0, 142.31, 170.52, 312.83),
 (542, 1421, '2015-11-13 09:07:09', 0, 64, 0, 64, 0, 479.36, 0, 479.36),
 (683, 1501, '2016-04-14 23:59:50', 0, 15, 16, 31, 0, 112.35, 129.92, 242.27),
 (713, 1521, '2014-11-23 16:04:03', 0, 8, 10, 18, 0, 59.92, 81.2, 141.12),
 (730, 1521, '2016-05-06 02:34:48', 0, 0, 2, 2, 0, 0, 16.24, 16.24)]

In [8]:
%%sql
SELECT *
FROM accounts
WHERE name = 'United Technologies'

 * sqlite:///pandp.db
Done.

[(1441, 'United Technologies', 'www.utc.com', 42.329397, -75.15785469, 'Janett Wisecarver', 321520)]

In [9]:
%%sql
SELECT *
FROM accounts
WHERE name != 'United Technologies'
limit 5

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (1011, 'Exxon Mobil', 'www.exxonmobil.com', 41.1691563, -73.84937379, 'Sung Shields', 321510),
 (1021, 'Apple', 'www.apple.com', 42.29049481, -76.08400942, 'Jodee Lupo', 321520),
 (1031, 'Berkshire Hathaway', 'www.berkshirehathaway.com', 40.94902131, -75.76389759, 'Serafina Banda', 321530),
 (1041, 'McKesson', 'www.mckesson.com', 42.21709326, -75.28499823, 'Angeles Crusoe', 321540)]

In [10]:
%%sql
SELECT name, website, primary_poc
FROM accounts
WHERE name = 'Exxon Mobil'

 * sqlite:///pandp.db
Done.

[('Exxon Mobil', 'www.exxonmobil.com', 'Sung Shields')]

### Arthmetic

In [11]:
%%sql
SELECT account_id,
       occurred_at,
       standard_qty,
       gloss_qty + poster_qty AS nonstandard_qty
FROM orders
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, '2015-10-06 17:31:14', 123, 46),
 (1001, '2015-11-05 03:34:33', 190, 98),
 (1001, '2015-12-04 04:21:55', 85, 47),
 (1001, '2016-01-02 01:18:24', 144, 32),
 (1001, '2016-02-01 19:27:27', 108, 57)]

In [12]:
%%sql
SELECT id, account_id, standard_amt_usd/standard_qty AS unit_price
FROM orders
LIMIT 10;

 * sqlite:///pandp.db
Done.

[(1, 1001, 4.99),
 (2, 1001, 4.99),
 (3, 1001, 4.989999999999999),
 (4, 1001, 4.989999999999999),
 (5, 1001, 4.989999999999999),
 (6, 1001, 4.99),
 (7, 1001, 4.99),
 (8, 1001, 4.99),
 (9, 1001, 4.989999999999999),
 (10, 1001, 4.99)]

In [13]:
%%sql
SELECT id, account_id, 
poster_amt_usd/(standard_amt_usd + gloss_amt_usd + poster_amt_usd) AS post_per
FROM orders
LIMIT 10;

 * sqlite:///pandp.db
Done.

[(1, 1001, 0.20019929527546923),
 (2, 1001, 0.269401582044551),
 (3, 1001, 0.0),
 (4, 1001, 0.0),
 (5, 1001, 0.23117672777557474),
 (6, 1001, 0.349983602717264),
 (7, 1001, 0.49862501668669074),
 (8, 1001, 0.5974661339050775),
 (9, 1001, 0.23737326760301367),
 (10, 1001, 0.07393917319249681)]

### like

In [14]:
%%sql
SELECT *
FROM accounts
WHERE website LIKE '%google%';

 * sqlite:///pandp.db
Done.

[(1351, 'Alphabet', 'www.google.com', 40.20427811, -75.07724145, 'Pamula Hammel', 321640)]

In [15]:
%%sql
SELECT name
FROM accounts
WHERE name LIKE 'C%';

 * sqlite:///pandp.db
Done.

[('CVS Health',),
 ('Chevron',),
 ('Costco',),
 ('Cardinal Health',),
 ('Citigroup',),
 ('Comcast',),
 ('Cisco Systems',),
 ('Caterpillar',),
 ('Coca-Cola',),
 ('Cigna',),
 ('CHS',),
 ('ConocoPhillips',),
 ('Capital One Financial',),
 ('Centene',),
 ('Community Health Systems',),
 ('Cummins',),
 ('CenturyLink',),
 ('Colgate-Palmolive',),
 ('ConAgra Foods',),
 ('CarMax',),
 ('CBS',),
 ('C.H. Robinson Worldwide',),
 ('CDW',),
 ('Chesapeake Energy',),
 ('Consolidated Edison',),
 ('Cognizant Technology Solutions',),
 ('Computer Sciences',),
 ('CSX',),
 ('CBRE Group',),
 ('Charter Communications',),
 ('CST Brands',),
 ('Celgene',),
 ('Corning',),
 ('Core-Mark Holding',),
 ('Cameron International',),
 ('Crown Holdings',),
 ('Campbell Soup',)]

In [16]:
%%sql
SELECT name
FROM accounts
WHERE name LIKE '%one%';

 * sqlite:///pandp.db
Done.

[('Honeywell International',),
 ('INTL FCStone',),
 ('Capital One Financial',),
 ('AutoZone',),
 ('Oneok',)]

In [17]:
%%sql
SELECT name
FROM accounts
WHERE name LIKE '%s'
limit 5;

 * sqlite:///pandp.db
Done.

[('General Motors',),
 ('United Technologies',),
 ("Lowe's",),
 ('UPS',),
 ('Cisco Systems',)]

## In

In [18]:
%%sql
SELECT *
FROM orders
WHERE account_id IN (1001,1021)
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49)]

In [19]:
%%sql
SELECT name, primary_poc, sales_rep_id
FROM accounts
WHERE name IN ('Walmart', 'Target', 'Nordstrom');

 * sqlite:///pandp.db
Done.

[('Walmart', 'Tamara Tuma', 321500),
 ('Target', 'Luba Streett', 321660),
 ('Nordstrom', 'Yan Crater', 321820)]

### Not

In [20]:
%%sql
SELECT sales_rep_id, 
       name
FROM accounts
WHERE sales_rep_id NOT IN (321500,321570)
ORDER BY sales_rep_id
limit 5;

 * sqlite:///pandp.db
Done.

[(321510, 'Exxon Mobil'),
 (321510, 'J.P. Morgan Chase'),
 (321510, 'PepsiCo'),
 (321510, 'Energy Transfer Equity'),
 (321510, 'Delta Air Lines')]

In [21]:
%%sql
SELECT *
FROM accounts
WHERE website NOT LIKE '%com%';

 * sqlite:///pandp.db
Done.

[(1811, 'TIAA', 'www.tiaa.org', 42.3595683, -71.05133234, 'Deeanna Burpo', 321640),
 (2241, 'Community Health Systems', 'www.chs.net', 41.87567906, -87.63221831, 'Grazyna Dewald', 321710)]

In [22]:
%%sql
SELECT name, primary_poc, sales_rep_id
FROM accounts
WHERE name NOT IN ('Walmart', 'Target', 'Nordstrom')
limit 5;

 * sqlite:///pandp.db
Done.

[('Exxon Mobil', 'Sung Shields', 321510),
 ('Apple', 'Jodee Lupo', 321520),
 ('Berkshire Hathaway', 'Serafina Banda', 321530),
 ('McKesson', 'Angeles Crusoe', 321540),
 ('UnitedHealth Group', 'Savanna Gayman', 321550)]

In [23]:
%%sql
SELECT *
FROM web_events
WHERE channel NOT IN ('organic', 'adwords')
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:13:58', 'direct'),
 (2, 1001, '2015-11-05 03:08:26', 'direct'),
 (3, 1001, '2015-12-04 03:57:24', 'direct'),
 (4, 1001, '2016-01-02 00:55:03', 'direct'),
 (5, 1001, '2016-02-01 19:02:33', 'direct')]

In [24]:
%%sql
SELECT name
FROM accounts
WHERE name NOT LIKE '%s'
limit 5;

 * sqlite:///pandp.db
Done.

[('Walmart',),
 ('Exxon Mobil',),
 ('Apple',),
 ('Berkshire Hathaway',),
 ('McKesson',)]

### AND & Between

In [25]:
%%sql
SELECT *
FROM orders
WHERE occurred_at >= '2016-04-01' AND occurred_at <= '2016-10-01'
ORDER BY occurred_at
limit 5;

 * sqlite:///pandp.db
Done.

[(1757, 2341, '2016-04-01 04:39:00', 500, 0, 21, 521, 2495, 0, 170.52, 2665.52),
 (1591, 2181, '2016-04-01 06:10:39', 298, 194, 0, 492, 1487.02, 1453.06, 0, 2940.08),
 (4312, 1001, '2016-04-01 11:15:27', 497, 618, 152, 1267, 2480.03, 4628.82, 1234.24, 8343.09),
 (7, 1001, '2016-04-01 11:20:18', 101, 33, 92, 226, 503.99, 247.17, 747.04, 1498.2),
 (589, 1441, '2016-04-01 16:01:34', 317, 38, 1, 356, 1581.83, 284.62, 8.12, 1874.57)]

In [26]:
%%sql
SELECT *
FROM orders
WHERE occurred_at BETWEEN '2016-04-01' AND '2016-10-01'
ORDER BY occurred_at
limit 5;

 * sqlite:///pandp.db
Done.

[(1757, 2341, '2016-04-01 04:39:00', 500, 0, 21, 521, 2495, 0, 170.52, 2665.52),
 (1591, 2181, '2016-04-01 06:10:39', 298, 194, 0, 492, 1487.02, 1453.06, 0, 2940.08),
 (4312, 1001, '2016-04-01 11:15:27', 497, 618, 152, 1267, 2480.03, 4628.82, 1234.24, 8343.09),
 (7, 1001, '2016-04-01 11:20:18', 101, 33, 92, 226, 503.99, 247.17, 747.04, 1498.2),
 (589, 1441, '2016-04-01 16:01:34', 317, 38, 1, 356, 1581.83, 284.62, 8.12, 1874.57)]

In [27]:
%%sql
SELECT *
FROM orders
WHERE standard_qty > 1000 AND poster_qty = 0 AND gloss_qty = 0;

 * sqlite:///pandp.db
Done.

[(2613, 2951, '2016-08-15 00:06:12', 1171, 0, 0, 1171, 5843.29, 0, 0, 5843.29),
 (3260, 3491, '2014-08-29 22:43:00', 1552, 0, 0, 1552, 7744.48, 0, 0, 7744.48)]

In [28]:
%%sql
SELECT name
FROM accounts
WHERE name NOT LIKE 'C%' AND name LIKE '%s'
limit 4;

 * sqlite:///pandp.db
Done.

[('General Motors',), ('United Technologies',), ("Lowe's",), ('UPS',)]

In [29]:
%%sql
SELECT *
FROM web_events
WHERE channel IN ('organic', 'adwords') AND occurred_at BETWEEN '2016-01-01' AND '2017-01-01'
ORDER BY occurred_at DESC
limit 5;

 * sqlite:///pandp.db
Done.

[(8493, 4141, '2016-12-31 16:31:23', 'organic'),
 (5661, 1851, '2016-12-31 06:55:38', 'organic'),
 (5562, 1791, '2016-12-31 02:08:50', 'adwords'),
 (7703, 3351, '2016-12-30 21:06:53', 'adwords'),
 (7921, 3521, '2016-12-30 20:15:48', 'organic')]

### or

In [30]:
%%sql
SELECT account_id,
       occurred_at,
       standard_qty,
       gloss_qty,
       poster_qty
FROM orders
WHERE standard_qty = 0 OR gloss_qty = 0 OR poster_qty = 0
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, '2015-12-04 04:21:55', 85, 47, 0),
 (1001, '2016-01-02 01:18:24', 144, 32, 0),
 (1001, '2016-07-30 03:26:30', 101, 36, 0),
 (1011, '2016-12-21 10:59:34', 527, 14, 0),
 (1021, '2015-10-12 02:21:56', 516, 23, 0)]

In [31]:
%%sql
SELECT account_id,
       occurred_at,
       standard_qty,
       gloss_qty,
       poster_qty
FROM orders
WHERE (standard_qty = 0 OR gloss_qty = 0 OR poster_qty = 0)
AND occurred_at = '2016-10-01'

 * sqlite:///pandp.db
Done.

[]

In [32]:
%%sql
SELECT id
FROM orders
WHERE gloss_qty > 4000 OR poster_qty > 4000
limit 5;

 * sqlite:///pandp.db
Done.

[(362,), (731,), (1191,), (1913,), (1939,)]

In [33]:
%%sql
SELECT *
FROM orders
WHERE standard_qty = 0 AND (gloss_qty > 1000 OR poster_qty > 1000);

 * sqlite:///pandp.db
Done.

[(1913, 2461, '2013-12-29 09:50:38', 0, 6450, 45, 6495, 0, 48310.5, 365.4, 48675.9),
 (4369, 1111, '2015-11-15 17:47:46', 0, 486, 2988, 3474, 0, 3640.14, 24262.56, 27902.7),
 (4391, 1161, '2016-06-04 08:58:10', 0, 106, 2967, 3073, 0, 793.94, 24092.04, 24885.98),
 (4420, 1191, '2016-05-21 23:21:14', 0, 43, 1448, 1491, 0, 322.07, 11757.76, 12079.83),
 (4448, 1231, '2016-06-25 12:27:15', 0, 3178, 23, 3201, 0, 23803.22, 186.76, 23989.98),
 (4698, 1451, '2015-02-26 06:13:21', 0, 484, 4901, 5385, 0, 3625.16, 39796.12, 43421.28),
 (4942, 1701, '2015-09-24 21:02:25', 0, 10744, 95, 10839, 0, 80472.56, 771.4, 81243.96),
 (5032, 1831, '2016-05-26 17:48:19', 0, 1448, 287, 1735, 0, 10845.52, 2330.44, 13175.96),
 (5191, 2051, '2015-05-17 14:17:59', 0, 1041, 0, 1041, 0, 7797.09, 0, 7797.09),
 (5791, 2861, '2014-10-24 12:06:22', 0, 10, 11691, 11701, 0, 74.9, 94930.92, 95005.82),
 (5805, 2861, '2016-09-29 04:51:11', 0, 60, 3122, 3182, 0, 449.4, 25350.64, 25800.04),
 (5895, 2931, '2016-01-18 09:21:18', 0, 519, 1315, 1834, 0, 3887.31, 10677.8, 14565.11),
 (5933, 3001, '2016-09-14 05:44:07', 0, 2802, 63, 2865, 0, 20986.98, 511.56, 21498.54),
 (6007, 3141, '2013-12-08 20:13:49', 0, 49, 1401, 1450, 0, 367.01, 11376.12, 11743.13),
 (6142, 3341, '2016-11-26 06:56:12', 0, 492, 1947, 2439, 0, 3685.08, 15809.64, 19494.72),
 (6285, 3491, '2015-02-22 09:54:25', 0, 1246, 0, 1246, 0, 9332.54, 0, 9332.54),
 (6332, 3571, '2016-09-18 15:30:41', 0, 51, 1752, 1803, 0, 381.99, 14226.24, 14608.23)]

In [34]:
%%sql
SELECT *
FROM accounts
WHERE (name LIKE 'C%' OR name LIKE 'W%') 
           AND ((primary_poc LIKE '%ana%' OR primary_poc LIKE '%Ana%') 
           AND primary_poc NOT LIKE '%eana%');

 * sqlite:///pandp.db
Done.

[(1061, 'CVS Health', 'www.cvshealth.com', 41.46779585, -73.76763638, 'Anabel Haskell', 321560),
 (1361, 'Comcast', 'www.comcastcorporation.com', 42.54154764, -76.24992387, 'Shana Sanborn', 321650)]

### SQL Joins

In [35]:
%%sql
SELECT orders.*,
       accounts.*
FROM orders 
JOIN accounts
ON orders.account_id = accounts.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500)]

In [36]:
%%sql
SELECT orders.*
FROM orders
JOIN accounts
ON orders.account_id = accounts.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49)]

In [37]:
%%sql
SELECT accounts.name, orders.occurred_at
FROM orders
JOIN accounts
ON orders.account_id = accounts.id
limit 5;

 * sqlite:///pandp.db
Done.

[('Walmart', '2015-10-06 17:31:14'),
 ('Walmart', '2015-11-05 03:34:33'),
 ('Walmart', '2015-12-04 04:21:55'),
 ('Walmart', '2016-01-02 01:18:24'),
 ('Walmart', '2016-02-01 19:27:27')]

In [38]:
%%sql
SELECT orders.standard_qty, orders.gloss_qty, 
 orders.poster_qty,  accounts.website, 
 accounts.primary_poc
FROM orders
JOIN accounts
ON orders.account_id = accounts.id
limit 5;

 * sqlite:///pandp.db
Done.

[(123, 22, 24, 'www.walmart.com', 'Tamara Tuma'),
 (190, 41, 57, 'www.walmart.com', 'Tamara Tuma'),
 (85, 47, 0, 'www.walmart.com', 'Tamara Tuma'),
 (144, 32, 0, 'www.walmart.com', 'Tamara Tuma'),
 (108, 29, 28, 'www.walmart.com', 'Tamara Tuma')]

In [39]:
%%sql
SELECT orders.*
FROM orders
JOIN accounts
ON orders.account_id = accounts.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49)]

### Alias

In [40]:
%%sql
SELECT o.*, a.*
FROM orders o
JOIN accounts a
ON o.account_id = a.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500)]

In [41]:
%%sql
SELECT a.primary_poc, w.occurred_at, w.channel, a.name
FROM web_events w
JOIN accounts a
ON w.account_id = a.id
WHERE a.name = 'Walmart';

 * sqlite:///pandp.db
Done.

[('Tamara Tuma', '2015-10-06 04:22:11', 'facebook', 'Walmart'),
 ('Tamara Tuma', '2015-10-06 17:13:58', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-10-22 05:02:47', 'organic', 'Walmart'),
 ('Tamara Tuma', '2015-10-22 14:04:20', 'adwords', 'Walmart'),
 ('Tamara Tuma', '2015-11-05 03:08:26', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-11-05 17:18:54', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-12-04 03:57:24', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-12-11 08:44:16', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-01-01 15:45:54', 'adwords', 'Walmart'),
 ('Tamara Tuma', '2016-01-02 00:55:03', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-01-13 19:31:14', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-02-01 19:02:33', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-02-07 17:44:10', 'adwords', 'Walmart'),
 ('Tamara Tuma', '2016-02-27 15:27:22', 'organic', 'Walmart'),
 ('Tamara Tuma', '2016-03-02 15:15:22', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-03-17 19:54:58', 'twitter', 'Walmart'),
 ('Tamara Tuma', '2016-04-01 10:58:55', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-04-05 03:02:52', 'organic', 'Walmart'),
 ('Tamara Tuma', '2016-04-17 16:41:02', 'organic', 'Walmart'),
 ('Tamara Tuma', '2016-05-01 14:26:40', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-05-01 15:26:44', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-05-07 02:28:31', 'banner', 'Walmart'),
 ('Tamara Tuma', '2016-05-21 16:22:01', 'organic', 'Walmart'),
 ('Tamara Tuma', '2016-05-31 20:53:47', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-06-02 04:41:31', 'facebook', 'Walmart'),
 ('Tamara Tuma', '2016-06-22 13:48:53', 'adwords', 'Walmart'),
 ('Tamara Tuma', '2016-06-30 12:09:45', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-07-12 22:43:02', 'banner', 'Walmart'),
 ('Tamara Tuma', '2016-07-26 11:29:09', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-07-26 21:08:52', 'banner', 'Walmart'),
 ('Tamara Tuma', '2016-07-30 03:06:26', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-08-12 09:31:22', 'organic', 'Walmart'),
 ('Tamara Tuma', '2016-08-28 06:42:42', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-09-01 18:33:56', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-09-11 17:06:53', 'adwords', 'Walmart'),
 ('Tamara Tuma', '2016-09-26 23:14:59', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-10-26 20:21:09', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-11-25 22:52:29', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-12-24 05:35:14', 'direct', 'Walmart')]

In [42]:
%%sql
SELECT r.name region, s.name rep, a.name account
FROM sales_reps s
JOIN region r
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
ORDER BY a.name
limit 5;

 * sqlite:///pandp.db
Done.

[('Northeast', 'Sibyl Lauria', '3M'),
 ('Southeast', 'Earlie Schleusner', 'ADP'),
 ('Southeast', 'Moon Torian', 'AECOM'),
 ('Southeast', 'Calvin Ollison', 'AES'),
 ('Northeast', 'Elba Felder', 'AIG')]

In [43]:
%%sql
SELECT r.name region, a.name account, 
    o.total_amt_usd/(o.total + 0.01) unit_price
FROM region r
JOIN sales_reps s
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
limit 5;

 * sqlite:///pandp.db
Done.

[('Northeast', 'Walmart', 5.833423765599567),
 ('Northeast', 'Walmart', 5.879706082872509),
 ('Northeast', 'Walmart', 5.646522151667762),
 ('Northeast', 'Walmart', 5.935815147625161),
 ('Northeast', 'Walmart', 6.0194924371875205)]

### left & Right Joins

In [44]:
%%sql
SELECT a.id, a.name, o.total
FROM orders o
JOIN accounts a
ON o.account_id = a.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 169),
 (1001, 'Walmart', 288),
 (1001, 'Walmart', 132),
 (1001, 'Walmart', 176),
 (1001, 'Walmart', 165)]

In [45]:
%%sql
SELECT a.id, a.name, o.total
FROM orders o
LEFT JOIN accounts a
ON o.account_id = a.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 169),
 (1001, 'Walmart', 288),
 (1001, 'Walmart', 132),
 (1001, 'Walmart', 176),
 (1001, 'Walmart', 165)]

In [46]:
%%sql
SELECT a.id, a.name, o.total
FROM orders o
RIGHT JOIN accounts a
ON o.account_id = a.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 169),
 (1001, 'Walmart', 288),
 (1001, 'Walmart', 132),
 (1001, 'Walmart', 176),
 (1001, 'Walmart', 165)]

### Joins & Filtering

In [47]:
%%sql
SELECT orders.*, accounts.*
FROM orders
LEFT JOIN accounts
ON orders.account_id = accounts.id 
WHERE accounts.sales_rep_id = 321500
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500)]

In [48]:
%%sql
SELECT orders.*, accounts.*
FROM orders
LEFT JOIN accounts
ON orders.account_id = accounts.id 
AND accounts.sales_rep_id = 321500
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500)]

In [49]:
%%sql
SELECT r.name region, a.name account, o.total_amt_usd/(o.total + 0.01) unit_price
FROM region r
JOIN sales_reps s
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
WHERE o.standard_qty > 100
limit 5;

 * sqlite:///pandp.db
Done.

[('Northeast', 'Walmart', 5.759600023667239),
 ('Northeast', 'Walmart', 5.965174820318739),
 ('Northeast', 'Walmart', 5.44423612294756),
 ('Northeast', 'Walmart', 5.960184231258712),
 ('Northeast', 'Walmart', 6.1687185711808565)]

In [50]:
%%sql
SELECT r.name region, a.name account, o.total_amt_usd/(o.total + 0.01) unit_price
FROM region r
JOIN sales_reps s
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
WHERE o.standard_qty > 100 AND o.poster_qty > 50
ORDER BY unit_price
limit 5;

 * sqlite:///pandp.db
Done.

[('Northeast', 'State Farm Insurance Cos.', 5.119282250254291),
 ('Southeast', 'DISH Network', 5.231815847540363),
 ('Northeast', 'Travelers Cos.', 5.2351813313106526),
 ('Northeast', 'Best Buy', 5.260426437930026),
 ('West', 'Stanley Black & Decker', 5.266395560073999)]

In [51]:
%%sql
SELECT r.name region, a.name account, o.total_amt_usd/(o.total + 0.01) unit_price
FROM region r
JOIN sales_reps s
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
WHERE o.standard_qty > 100 AND o.poster_qty > 50
ORDER BY unit_price DESC
limit 5;

 * sqlite:///pandp.db
Done.

[('Northeast', 'IBM', 8.089906082278144),
 ('West', 'Mosaic', 8.066329210358129),
 ('West', 'Pacific Life', 8.063022652514793),
 ('Northeast', 'CHS', 8.018849326780114),
 ('West', 'Fidelity National Financial', 7.9928024668468325)]

In [52]:
%%sql
SELECT DISTINCT a.name, w.channel
FROM accounts a
JOIN web_events w
ON a.id = w.account_id
WHERE a.id = '1001';

 * sqlite:///pandp.db
Done.

[('Walmart', 'adwords'),
 ('Walmart', 'banner'),
 ('Walmart', 'direct'),
 ('Walmart', 'facebook'),
 ('Walmart', 'organic'),
 ('Walmart', 'twitter')]

In [53]:
%%sql
SELECT o.occurred_at, a.name, o.total, o.total_amt_usd
FROM accounts a
JOIN orders o
ON o.account_id = a.id
WHERE o.occurred_at BETWEEN '01-01-2015' AND '01-01-2016'
ORDER BY o.occurred_at DESC;

 * sqlite:///pandp.db
Done.

[]

## Agregate functions

In [54]:
%%sql
SELECT *
FROM accounts
WHERE id > 1500 and id < 1600

 * sqlite:///pandp.db
Done.

[(1501, 'Intel', 'www.intel.com', 41.03153857, -74.66846407, 'Elouise Beyers', 321580),
 (1511, 'Humana', 'www.humana.com', 41.43233665, -77.00496342, 'Bettye Close', 321590),
 (1521, 'Disney', 'www.disney.com', 41.87879976, -74.81102607, 'Timika Mistretta', 321600),
 (1531, 'Cisco Systems', 'www.cisco.com', 41.20101093, -76.53824668, 'Deadra Waggener', 321610),
 (1541, 'Pfizer', 'www.pfizer.com', 40.69325986, -75.79453197, 'Olevia Taubman', 321620),
 (1551, 'Dow Chemical', 'www.dow.com', 40.53050671, -74.66656358, 'Lillia Ogden', 321630),
 (1561, 'Sysco', 'www.sysco.com', 40.76252413, -73.97753022, 'Julia Laracuente', 321640),
 (1571, 'FedEx', 'www.fedex.com', 40.75290524, -73.97519248, 'Keren Mcconn', 321650),
 (1581, 'Caterpillar', 'www.caterpillar.com', 40.74789383, -73.97738651, 'Latia Beene', 321660),
 (1591, 'Lockheed Martin', 'www.lockheedmartin.com', 40.75497089, -73.98233134, 'Jared Aikins', 321670)]

In [55]:
%%sql
SELECT *
FROM accounts
WHERE primary_poc = NULL

 * sqlite:///pandp.db
Done.

[]

In [56]:
%%sql
SELECT *
FROM accounts
WHERE primary_poc IS NOT NULL
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (1011, 'Exxon Mobil', 'www.exxonmobil.com', 41.1691563, -73.84937379, 'Sung Shields', 321510),
 (1021, 'Apple', 'www.apple.com', 42.29049481, -76.08400942, 'Jodee Lupo', 321520),
 (1031, 'Berkshire Hathaway', 'www.berkshirehathaway.com', 40.94902131, -75.76389759, 'Serafina Banda', 321530),
 (1041, 'McKesson', 'www.mckesson.com', 42.21709326, -75.28499823, 'Angeles Crusoe', 321540)]

In [57]:
%%sql
SELECT *
FROM accounts
WHERE primary_poc IS NULL

 * sqlite:///pandp.db
Done.

[]

### count

In [58]:
%%sql
SELECT COUNT(*)
FROM accounts;

 * sqlite:///pandp.db
Done.

[(351,)]

In [59]:
%%sql
SELECT COUNT(accounts.id)
FROM accounts;

 * sqlite:///pandp.db
Done.

[(351,)]

In [60]:
%%sql
SELECT *
FROM orders
WHERE occurred_at >= '2016-12-01'
AND occurred_at < '2017-01-01'
limit 5;

 * sqlite:///pandp.db
Done.

[(16, 1001, '2016-12-24 05:53:13', 123, 127, 19, 269, 613.77, 951.23, 154.28, 1719.28),
 (17, 1011, '2016-12-21 10:59:34', 527, 14, 0, 541, 2629.73, 104.86, 0, 2734.59),
 (24, 1031, '2016-12-25 03:54:27', 1148, 0, 215, 1363, 5728.52, 0, 1745.8, 7474.32),
 (27, 1041, '2016-12-12 07:50:01', 157, 34, 21, 212, 783.43, 254.66, 170.52, 1208.61),
 (33, 1051, '2016-12-30 08:45:43', 495, 1, 1, 497, 2470.05, 7.49, 8.12, 2485.66)]

In [61]:
%%sql
SELECT COUNT(*)
FROM orders
WHERE occurred_at >= '2016-12-01'
AND occurred_at < '2017-01-01'

 * sqlite:///pandp.db
Done.

[(463,)]

In [62]:
%%sql
SELECT COUNT(*) AS order_count
FROM orders
WHERE occurred_at >= '2016-12-01'
AND occurred_at < '2017-01-01'

 * sqlite:///pandp.db
Done.

[(463,)]

In [63]:
%%sql
SELECT COUNT(primary_poc) AS account_primary_poc_count
FROM accounts

 * sqlite:///pandp.db
Done.

[(351,)]

In [64]:
%%sql
SELECT *
FROM accounts
WHERE primary_poc IS NULL

 * sqlite:///pandp.db
Done.

[]

### sum

In [65]:
%%sql
SELECT SUM(standard_qty) AS standard,
       SUM(gloss_qty) AS gloss,
       SUM(poster_qty) AS poster
FROM orders

 * sqlite:///pandp.db
Done.

[(1938346, 1013773, 723646)]

In [66]:
%%sql
SELECT SUM(poster_qty) AS total_poster_sales
FROM orders;

 * sqlite:///pandp.db
Done.

[(723646,)]

In [67]:
%%sql
SELECT standard_amt_usd + gloss_amt_usd AS total_standard_gloss
FROM orders
limit 4;

 * sqlite:///pandp.db
Done.

[(778.55,), (1255.19,), (776.18,), (958.24,)]

In [68]:
%%sql
SELECT SUM(standard_amt_usd)/SUM(standard_qty) AS standard_price_per_unit
FROM orders;

 * sqlite:///pandp.db
Done.

[(4.990000000000011,)]

In [69]:
%%sql
SELECT MIN(standard_qty) AS standard_min,
       MIN(gloss_qty) AS gloss_min,
       MIN(poster_qty) AS poster_min,
       MAX(standard_qty) AS standard_max,
       MAX(gloss_qty) AS gloss_max,
       MAX(poster_qty) AS poster_max
FROM   orders

 * sqlite:///pandp.db
Done.

[(0, 0, 0, 22591, 14281, 28262)]

## average

In [70]:
%%sql
SELECT AVG(standard_qty) AS standard_avg,
       AVG(gloss_qty) AS gloss_avg,
       AVG(poster_qty) AS poster_avg
FROM orders

 * sqlite:///pandp.db
Done.

[(280.43200231481484, 146.6685474537037, 104.6941550925926)]

In [71]:
%%sql
SELECT MAX(occurred_at)
FROM web_events;

 * sqlite:///pandp.db
Done.

[('2017-01-01 23:51:09',)]

In [72]:
%%sql
SELECT occurred_at
FROM web_events
ORDER BY occurred_at DESC
LIMIT 1;

 * sqlite:///pandp.db
Done.

[('2017-01-01 23:51:09',)]

In [73]:
%%sql
SELECT AVG(standard_qty) mean_standard, AVG(gloss_qty) mean_gloss, 
        AVG(poster_qty) mean_poster, AVG(standard_amt_usd) mean_standard_usd, 
        AVG(gloss_amt_usd) mean_gloss_usd, AVG(poster_amt_usd) mean_poster_usd
FROM orders;

 * sqlite:///pandp.db
Done.

[(280.43200231481484, 146.6685474537037, 104.6941550925926, 1399.3556915509291, 1098.547420428239, 850.1165393518496)]

In [74]:
%%sql
SELECT *
FROM (SELECT total_amt_usd
   FROM orders
   ORDER BY total_amt_usd
   LIMIT 3457) AS Table1
ORDER BY total_amt_usd DESC
LIMIT 2;

 * sqlite:///pandp.db
Done.

[(2483.16,), (2482.55,)]

## Group By

In [75]:
%%sql
SELECT account_id,
       SUM(standard_qty) AS standard,
       SUM(gloss_qty) AS gloss,
       SUM(poster_qty) AS poster
FROM orders
GROUP BY account_id
ORDER BY account_id

 * sqlite:///pandp.db
Done.

[(1001, 7896, 7831, 3197),
 (1011, 527, 14, 0),
 (1021, 3152, 483, 175),
 (1031, 1148, 0, 215),
 (1041, 836, 770, 646),
 (1051, 3608, 356, 156),
 (1061, 925, 1556, 911),
 (1071, 803, 484, 291),
 (1081, 8193, 8744, 5965),
 (1091, 4603, 1819, 1854),
 (1101, 1940, 1096, 917),
 (1111, 712, 1049, 3366),
 (1121, 7504, 5949, 4110),
 (1131, 1949, 2866, 1913),
 (1141, 855, 1116, 2231),
 (1151, 541, 50, 87),
 (1161, 5394, 802, 3328),
 (1171, 1563, 1569, 1124),
 (1181, 22099, 1402, 1155),
 (1191, 6304, 1282, 1860),
 (1201, 1001, 156, 129),
 (1211, 664, 1637, 433),
 (1221, 12933, 2618, 1298),
 (1231, 5404, 3335, 1619),
 (1241, 1150, 419, 810),
 (1251, 6184, 5932, 2208),
 (1261, 9009, 12583, 7509),
 (1271, 736, 626, 284),
 (1281, 21943, 3647, 2862),
 (1291, 7437, 7410, 4749),
 (1301, 15798, 15050, 16658),
 (1311, 1965, 3481, 1988),
 (1321, 7619, 733, 490),
 (1331, 1679, 1290, 606),
 (1341, 17026, 2117, 1354),
 (1351, 3174, 2496, 1216),
 (1361, 2058, 128, 202),
 (1371, 7417, 6240, 4529),
 (1381, 954, 1052, 690),
 (1391, 1496, 19, 1),
 (1401, 13049, 16145, 10669),
 (1411, 19041, 3845, 1652),
 (1421, 11941, 14598, 8042),
 (1431, 2082, 2102, 488),
 (1441, 12780, 14043, 8140),
 (1451, 11689, 10799, 12139),
 (1461, 7134, 485, 818),
 (1471, 801, 646, 227),
 (1481, 601, 698, 216),
 (1491, 7728, 9264, 6137),
 (1501, 7941, 10197, 6369),
 (1511, 5372, 617, 186),
 (1521, 17498, 14043, 1649),
 (1531, 20079, 1423, 2471),
 (1541, 7927, 10566, 3223),
 (1551, 362, 555, 304),
 (1561, 12992, 15720, 11823),
 (1571, 18833, 1849, 1495),
 (1581, 4832, 6081, 1483),
 (1591, 457, 4, 16),
 (1601, 18237, 2504, 2111),
 (1611, 6960, 597, 553),
 (1621, 601, 696, 260),
 (1631, 1457, 1548, 780),
 (1641, 1333, 951, 710),
 (1651, 4720, 1804, 1275),
 (1661, 4066, 256, 970),
 (1671, 149, 9, 6),
 (1681, 4408, 4428, 2644),
 (1691, 5925, 585, 474),
 (1701, 7474, 13557, 3085),
 (1711, 9654, 991, 1101),
 (1721, 1176, 1231, 226),
 (1741, 10727, 1589, 2578),
 (1751, 678, 39, 31),
 (1761, 1782, 1970, 934),
 (1771, 2704, 689, 200),
 (1781, 21416, 1826, 878),
 (1791, 17823, 2519, 1364),
 (1801, 6726, 5384, 2819),
 (1811, 1119, 154, 152),
 (1821, 330, 73, 22),
 (1831, 4589, 6085, 12167),
 (1841, 7086, 993, 340),
 (1851, 9261, 1152, 900),
 (1861, 369, 537, 308),
 (1871, 13583, 18854, 11293),
 (1881, 20639, 1807, 2897),
 (1891, 2585, 181, 163),
 (1901, 0, 25, 25),
 (1911, 832, 827, 60),
 (1921, 8775, 7833, 3139),
 (1931, 3012, 245, 2537),
 (1941, 2401, 1039, 960),
 (1951, 2577, 1471, 2240),
 (1961, 102, 39, 29),
 (1971, 708, 780, 629),
 (1981, 4578, 4444, 1644),
 (1991, 1667, 135, 312),
 (2001, 4030, 476, 228),
 (2011, 3740, 4656, 1635),
 (2021, 1488, 200, 85),
 (2031, 1347, 2067, 1203),
 (2041, 15257, 7777, 2734),
 (2051, 19442, 2769, 2444),
 (2061, 978, 68, 28),
 (2071, 3449, 189, 73),
 (2081, 2475, 3248, 1303),
 (2091, 8055, 461, 1289),
 (2101, 11350, 6043, 4571),
 (2111, 4629, 5122, 1371),
 (2121, 2387, 2403, 871),
 (2131, 1756, 2807, 2098),
 (2141, 6893, 6962, 3981),
 (2151, 3211, 3976, 1395),
 (2161, 1731, 2325, 812),
 (2171, 2169, 2789, 2077),
 (2181, 12782, 17642, 10480),
 (2191, 5171, 5439, 3471),
 (2201, 2011, 73, 117),
 (2211, 1314, 2245, 456),
 (2221, 715, 834, 176),
 (2231, 12574, 13949, 8835),
 (2241, 4503, 3239, 1221),
 (2251, 3426, 114, 238),
 (2261, 3782, 3834, 1416),
 (2271, 7271, 8937, 4957),
 (2281, 3675, 352, 509),
 (2291, 4683, 5036, 2577),
 (2301, 2635, 1486, 291),
 (2311, 2436, 174, 278),
 (2321, 355, 522, 302),
 (2331, 4093, 690, 908),
 (2341, 16656, 1141, 3227),
 (2351, 18828, 2545, 2809),
 (2361, 11177, 1041, 1146),
 (2371, 6033, 5901, 2773),
 (2381, 8123, 608, 602),
 (2391, 2498, 1954, 730),
 (2401, 599, 631, 200),
 (2411, 19752, 2216, 1331),
 (2421, 1192, 1543, 1106),
 (2431, 1325, 21, 67),
 (2441, 13148, 2000, 1172),
 (2451, 328, 627, 1052),
 (2461, 5204, 11370, 6178),
 (2471, 2071, 1857, 1305),
 (2481, 19436, 1147, 1304),
 (2491, 1067, 76, 353),
 (2501, 4630, 235, 528),
 (2511, 3426, 253, 156),
 (2521, 3958, 287, 476),
 (2531, 2275, 826, 761),
 (2541, 12382, 15027, 9478),
 (2551, 3274, 125, 150),
 (2561, 2012, 1283, 477),
 (2571, 3997, 4586, 3073),
 (2581, 1788, 2348, 2220),
 (2591, 13475, 16953, 9984),
 (2601, 5501, 474, 151),
 (2611, 6950, 555, 498),
 (2621, 506, 137, 218),
 (2631, 23321, 2427, 2359),
 (2641, 5027, 398, 490),
 (2651, 4231, 6726, 1257),
 (2661, 2450, 2613, 1085),
 (2671, 11646, 11636, 5319),
 (2681, 7029, 13497, 6071),
 (2691, 10083, 501, 846),
 (2701, 2137, 1322, 3158),
 (2711, 4513, 502, 179),
 (2721, 290, 89, 40),
 (2731, 19790, 2677, 1489),
 (2741, 2080, 3386, 1653),
 (2751, 882, 1206, 703),
 (2761, 656, 1059, 688),
 (2771, 1344, 1167, 488),
 (2781, 370, 24, 16),
 (2791, 849, 723, 69),
 (2801, 3529, 219, 122),
 (2811, 1529, 1161, 694),
 (2821, 3945, 4213, 1271),
 (2831, 2973, 1732, 1360),
 (2841, 6906, 712, 967),
 (2851, 6486, 564, 563),
 (2861, 21171, 2234, 16165),
 (2871, 19649, 2343, 2127),
 (2881, 20156, 2435, 1496),
 (2891, 764, 912, 295),
 (2901, 3771, 3295, 2556),
 (2911, 4559, 6411, 7457),
 (2921, 3069, 3782, 1981),
 (2931, 12531, 15589, 11067),
 (2941, 790, 695, 201),
 (2951, 8181, 592, 766),
 (2961, 1811, 1773, 1103),
 (2971, 8740, 876, 581),
 (2981, 962, 1015, 1144),
 (2991, 1968, 726, 2306),
 (3001, 6493, 3958, 534),
 (3011, 632, 625, 235),
 (3021, 297, 32, 853),
 (3031, 3558, 3760, 1889),
 (3041, 3626, 4333, 3335),
 (3051, 18724, 3971, 1520),
 (3061, 12507, 1065, 1605),
 (3071, 336, 512, 240),
 (3081, 4275, 365, 280),
 (3091, 498, 0, 10),
 (3101, 3937, 2668, 3425),
 (3111, 9427, 8428, 2940),
 (3121, 5667, 445, 254),
 (3131, 3903, 4412, 3321),
 (3141, 20231, 1478, 3239),
 (3151, 621, 608, 232),
 (3161, 1962, 319, 752),
 (3171, 4211, 580, 362),
 (3181, 7788, 504, 1497),
 (3191, 4964, 6135, 3797),
 (3201, 1140, 563, 20),
 (3211, 696, 1013, 640),
 (3221, 2718, 2909, 1131),
 (3231, 1145, 848, 451),
 (3241, 6563, 7075, 2386),
 (3251, 8036, 8880, 6270),
 (3261, 14985, 1839, 964),
 (3271, 378, 86, 89),
 (3281, 352, 0, 113),
 (3291, 3808, 3913, 1748),
 (3301, 1264, 1135, 424),
 (3311, 9203, 610, 664),
 (3321, 3288, 1003, 504),
 (3331, 1194, 1251, 260),
 (3341, 3073, 3906, 3819),
 (3351, 2022, 366, 289),
 (3361, 3784, 403, 377),
 (3371, 79, 75, 14),
 (3381, 1921, 2083, 1302),
 (3391, 2608, 4293, 1356),
 (3401, 116, 41, 28),
 (3411, 13394, 17423, 11541),
 (3421, 4082, 3794, 1948),
 (3431, 13839, 14610, 8154),
 (3441, 3660, 309, 208),
 (3451, 3783, 126, 2117),
 (3461, 18729, 1583, 2240),
 (3471, 21278, 3632, 3719),
 (3481, 2254, 2683, 1801),
 (3491, 22936, 2792, 1507),
 (3501, 1074, 480, 533),
 (3511, 2644, 183, 150),
 (3521, 183, 106, 82),
 (3531, 3603, 1412, 1243),
 (3541, 5170, 293, 1013),
 (3551, 11382, 1450, 632),
 (3561, 2503, 942, 53),
 (3571, 3460, 355, 2016),
 (3581, 577, 568, 318),
 (3591, 4619, 6111, 3652),
 (3601, 1818, 2332, 1436),
 (3611, 3382, 162, 115),
 (3621, 1041, 1150, 687),
 (3631, 6051, 6818, 4669),
 (3641, 3060, 705, 269),
 (3651, 8004, 653, 628),
 (3661, 5155, 503, 150),
 (3671, 1554, 2328, 1268),
 (3681, 1572, 249, 154),
 (3691, 3141, 742, 107),
 (3701, 1613, 208, 81),
 (3711, 2171, 3756, 4294),
 (3721, 9112, 5484, 4594),
 (3731, 1974, 98, 113),
 (3741, 117, 22, 60),
 (3751, 10165, 637, 1529),
 (3761, 1542, 621, 954),
 (3771, 1930, 2130, 1278),
 (3781, 1662, 2763, 1180),
 (3791, 3252, 3835, 2587),
 (3801, 3096, 213, 670),
 (3811, 1771, 2244, 4692),
 (3821, 3330, 3343, 1894),
 (3831, 960, 190, 35),
 (3841, 333, 542, 328),
 (3851, 3625, 186, 394),
 (3861, 535, 167, 74),
 (3871, 827, 686, 314),
 (3881, 13806, 3974, 1222),
 (3891, 1035, 14, 0),
 (3901, 922, 569, 572),
 (3911, 18916, 1599, 3640),
 (3921, 1096, 79, 111),
 (3931, 720, 703, 209),
 (3941, 148, 231, 77),
 (3951, 1141, 791, 577),
 (3961, 1133, 110, 88),
 (3971, 2428, 2396, 935),
 (3981, 16923, 1614, 3254),
 (3991, 12660, 1128, 2786),
 (4001, 517, 10, 2),
 (4011, 3981, 2266, 201),
 (4021, 727, 659, 200),
 (4031, 4701, 4923, 3524),
 (4041, 5378, 5519, 3500),
 (4051, 996, 98, 86),
 (4061, 12841, 1027, 1601),
 (4071, 349, 29, 21),
 (4081, 655, 1067, 704),
 (4091, 670, 546, 351),
 (4101, 3232, 129, 11445),
 (4111, 9836, 10978, 20019),
 (4121, 619, 200, 413),
 (4131, 1293, 1274, 522),
 (4141, 2495, 163, 364),
 (4151, 14103, 16058, 19085),
 (4161, 41617, 1987, 1146),
 (4171, 5761, 507, 697),
 (4181, 11292, 805, 626),
 (4191, 3692, 3259, 992),
 (4201, 3985, 5514, 1715),
 (4211, 17488, 32442, 6480),
 (4221, 446, 203, 245),
 (4231, 4574, 4578, 2859),
 (4241, 4496, 318, 85),
 (4251, 4364, 394, 28398),
 (4261, 1892, 2183, 1094),
 (4271, 10652, 10735, 5690),
 (4281, 4635, 5539, 4250),
 (4291, 12722, 13903, 9125),
 (4301, 3377, 4843, 2710),
 (4311, 21448, 1755, 4045),
 (4321, 123, 0, 33),
 (4331, 300, 303, 243),
 (4341, 7532, 1390, 794),
 (4351, 1448, 1501, 991),
 (4361, 1029, 1588, 1076),
 (4371, 485, 70, 10),
 (4381, 2038, 2724, 1314),
 (4391, 1564, 135, 232),
 (4401, 304, 34, 26),
 (4411, 591, 570, 332),
 (4421, 2861, 4461, 1154),
 (4431, 8849, 8177, 3735),
 (4441, 2070, 535, 693),
 (4451, 11228, 5079, 1610),
 (4461, 10697, 12646, 8544),
 (4471, 417, 51, 47),
 (4481, 450, 283, 647),
 (4491, 6411, 6702, 3693),
 (4501, 1015, 659, 570)]

In [76]:
%%sql
SELECT a.name, o.occurred_at
FROM accounts a
JOIN orders o
ON a.id = o.account_id
ORDER BY occurred_at
LIMIT 1;

 * sqlite:///pandp.db
Done.

[('DISH Network', '2013-12-04 04:22:44')]

In [77]:
%%sql
SELECT a.name, SUM(total_amt_usd) total_sales
FROM orders o
JOIN accounts a
ON a.id = o.account_id
GROUP BY a.name;

 * sqlite:///pandp.db
Done.

[('3M', 127945.1),
 ('ADP', 163579.18),
 ('AECOM', 18491.510000000002),
 ('AES', 13038.64),
 ('AIG', 9980.929999999998),
 ('AT&T', 51647.76000000002),
 ('AbbVie', 11243.630000000001),
 ('Abbott Laboratories', 96819.92000000001),
 ('Advance Auto Parts', 6962.07),
 ('Aetna', 237781.3),
 ('Aflac', 117862.77),
 ('Air Products & Chemicals', 11814.55),
 ('Alcoa', 19882.160000000003),
 ('Allstate', 96779.18000000001),
 ('Ally Financial', 37653.96),
 ('Alphabet', 44407.22),
 ('Altria Group', 116165.15),
 ('Amazon.com', 28678.06),
 ('American Airlines Group', 30083.179999999993),
 ('American Electric Power', 32044.55),
 ('American Express', 45557.50999999999),
 ('American Family Insurance Group', 153015.86999999997),
 ('Ameriprise Financial', 55883.55000000001),
 ('AmerisourceBergen', 38741.81),
 ('Amgen', 82013.04999999999),
 ('Anadarko Petroleum', 80328.56),
 ('Anthem', 47487.78),
 ('Apple', 20767.15),
 ('Applied Materials', 3093.95),
 ('Aramark', 21692.010000000002),
 ('Archer Daniels Midland', 272672.83999999997),
 ('Arrow Electronics', 281018.36),
 ('Assurant', 1235.81),
 ('AutoNation', 135822.85000000003),
 ('AutoZone', 65958.07),
 ('Autoliv', 10282.96),
 ('Avis Budget Group', 241711.24999999997),
 ('Avnet', 66812.23999999999),
 ('BB&T Corp.', 123847.32),
 ('Baker Hughes', 19409.949999999997),
 ('Ball', 1982.74),
 ('Bank of America Corp.', 93217.79999999999),
 ('Bank of New York Mellon Corp.', 2155.98),
 ('Baxter International', 22681.17),
 ('Becton Dickinson', 35961.76),
 ('Bed Bath & Beyond', 1069.64),
 ('Berkshire Hathaway', 7474.32),
 ('Best Buy', 163887.39000000004),
 ('Biogen', 19386.53),
 ('BlackRock', 147599.56),
 ('Boeing', 65091.39),
 ('BorgWarner', 41242.060000000005),
 ('Bristol-Myers Squibb', 188457.45999999996),
 ('Broadcom', 75130.49999999999),
 ('C.H. Robinson Worldwide', 7460.32),
 ('CBRE Group', 9715.710000000001),
 ('CBS', 8648.07),
 ('CDW', 101553.15000000001),
 ('CHS', 167271.8),
 ('CST Brands', 122957.11000000004),
 ('CSX', 35759.700000000004),
 ('CVS Health', 23667.51),
 ('Cameron International', 67459.64999999998),
 ('Campbell Soup', 25765.949999999997),
 ('Capital One Financial', 72595.01000000001),
 ('CarMax', 64251.560000000005),
 ('Cardinal Health', 7210.91),
 ('Caterpillar', 81700.32999999999),
 ('Celgene', 96593.53),
 ('Centene', 238962.47000000003),
 ('CenturyLink', 44535.04),
 ('Charter Communications', 135924.15),
 ('Chesapeake Energy', 44534.950000000004),
 ('Chevron', 46725.41),
 ('Cigna', 127671.94000000002),
 ('Cisco Systems', 130917.00000000001),
 ('Citigroup', 160051.04000000007),
 ('Coca-Cola', 43692.28999999999),
 ('Cognizant Technology Solutions', 62504.05),
 ('Colgate-Palmolive', 130893.51000000001),
 ('Comcast', 12868.38),
 ('Community Health Systems', 56644.600000000006),
 ('Computer Sciences', 28012.069999999996),
 ('ConAgra Foods', 19142.48),
 ('ConocoPhillips', 15578.4),
 ('Consolidated Edison', 2674.04),
 ('Core-Mark Holding', 231856.97999999992),
 ('Corning', 7940.370000000001),
 ('Costco', 30741.01),
 ('Crown Holdings', 75110.81),
 ('Cummins', 34839.82),
 ('D.R. Horton', 98474.43999999999),
 ('DISH Network', 253635.7500000001),
 ('DTE Energy', 11501.84),
 ('DaVita HealthCare Partners', 33982.78),
 ('Danaher', 8133.47),
 ('Dean Foods', 26514.93),
 ('Deere', 1036.57),
 ('Delta Air Lines', 859.64),
 ('Devon Energy', 9536.550000000001),
 ('Discover Financial Services', 57035.05),
 ('Disney', 205886.96999999994),
 ('Dollar General', 49975.93),
 ('Dollar Tree', 10212.060000000001),
 ('Dominion Resources', 64604.0),
 ('Dow Chemical', 8431.81),
 ('DuPont', 25526.3),
 ('Duke Energy', 118867.17000000001),
 ('EMC', 36982.12),
 ('EOG Resources', 382873.3),
 ('Eastman Chemical', 16303.42),
 ('Ecolab', 135517.95),
 ('Edison International', 37010.95),
 ('Eli Lilly', 9339.199999999999),
 ('Emerson Electric', 143471.26),
 ('Energy Transfer Equity', 19539.86),
 ('Entergy', 123503.17999999995),
 ('Enterprise Products Partners', 31971.72),
 ('Estee Lauder', 38198.82000000001),
 ('Eversource Energy', 57059.76),
 ('Exelon', 27558.300000000007),
 ('Express Scripts Holding', 19090.449999999997),
 ('Exxon Mobil', 2734.59),
 ('Facebook', 23522.79),
 ('Fannie Mae', 3780.53),
 ('Farmers Insurance Exchange', 96376.93999999999),
 ('FedEx', 119965.08000000002),
 ('Fidelity National Financial', 110027.29000000001),
 ('First Data', 45967.25),
 ('FirstEnergy', 132868.82),
 ('Fluor', 251299.77),
 ('Ford Motor', 154811.42999999996),
 ('Franklin Resources', 135730.44000000003),
 ('Freddie Mac', 234225.65),
 ('Freeport-McMoRan', 49162.7),
 ('GameStop', 38469.65),
 ('Gap', 16791.91),
 ('General Dynamics', 300694.7899999999),
 ('General Electric', 25335.68),
 ('General Mills', 32226.369999999995),
 ('General Motors', 9995.05),
 ('Genuine Parts', 61561.44),
 ('Genworth Financial', 6402.380000000001),
 ('Gilead Sciences', 62148.869999999995),
 ('Global Partners', 67909.95999999999),
 ('Goodyear Tire & Rubber', 185463.76000000004),
 ('Group 1 Automotive', 30708.920000000002),
 ('Guardian Life Ins. Co. of America', 157523.23999999996),
 ('HCA Holdings', 10323.23),
 ('HD Supply Holdings', 50888.03),
 ('HP', 56162.34),
 ('Halliburton', 32645.38),
 ('Hartford Financial Services Group', 20257.430000000004),
 ('Health Net', 27733.33),
 ('Henry Schein', 35487.34),
 ('Hertz Global Holdings', 10959.77),
 ('Hilton Worldwide Holdings', 38648.009999999995),
 ('HollyFrontier', 79488.37000000001),
 ('Home Depot', 10667.46),
 ('Honeywell International', 86362.69999999998),
 ('Hormel Foods', 88946.13999999998),
 ('Humana', 32937.92999999999),
 ('Huntsman', 20092.350000000002),
 ('IBM', 326819.48000000004),
 ('INTL FCStone', 2372.11),
 ('Icahn Enterprises', 38851.149999999994),
 ('Illinois Tool Works', 67439.95000000001),
 ('Ingram Micro', 25198.550000000003),
 ('Intel', 167717.4),
 ('International Paper', 59086.759999999995),
 ('J.C. Penney', 3253.0400000000004),
 ('J.P. Morgan Chase', 94684.25),
 ('Jabil Circuit', 79246.93),
 ('Jacobs Engineering Group', 75600.49),
 ('Jarden', 179761.43000000002),
 ('Johnson & Johnson', 18242.739999999998),
 ('Johnson Controls', 37796.280000000006),
 ('KKR', 217473.85000000003),
 ('Kellogg', 83419.37999999996),
 ('Kimberly-Clark', 29151.210000000003),
 ('Kinder Morgan', 54891.56),
 ("Kohl's", 90105.16),
 ('Kraft Heinz', 25765.170000000002),
 ('Kroger', 59946.4),
 ('L Brands', 17439.25),
 ('L-3 Communications', 22266.77),
 ('Laboratory Corp. of America', 25507.06),
 ("Land O'Lakes", 138323.58999999997),
 ('Las Vegas Sands', 1113.29),
 ('Lear', 23718.31),
 ('Lennar', 2670.97),
 ('Leucadia National', 291047.25000000006),
 ('Level 3 Communications', 881.73),
 ('Liberty Interactive', 6497.7),
 ('Liberty Mutual Insurance Group', 16923.55),
 ('Lincoln National', 77628.11),
 ('Lithia Motors', 107142.63000000003),
 ('Lockheed Martin', 2440.31),
 ('Loews', 2566.22),
 ("Lowe's", 45873.469999999994),
 ('MGM Resorts International', 16976.760000000002),
 ("Macy's", 9613.32),
 ('ManpowerGroup', 7313.08),
 ('Marathon Petroleum', 137227.88),
 ('Marriott International', 10779.77),
 ('Marsh & McLennan', 16257.21),
 ('Masco', 19963.61),
 ('Massachusetts Mutual Life Insurance', 3927.05),
 ('MasterCard', 10555.349999999999),
 ("McDonald's", 47258.13),
 ('McKesson', 15184.460000000001),
 ('Merck', 64536.16999999999),
 ('MetLife', 7615.47),
 ('Micron Technology', 2438.51),
 ('Microsoft', 15454.01),
 ('Mohawk Industries', 3025.65),
 ('Molina Healthcare', 66381.57),
 ('Mondelez International', 37465.37),
 ('Monsanto', 130964.10999999999),
 ('Morgan Stanley', 20277.570000000003),
 ('Mosaic', 345618.5900000001),
 ('Murphy USA', 36294.27),
 ('NGL Energy Partners', 40607.06999999999),
 ('NRG Energy', 59727.21),
 ('National Oilwell Varco', 131318.63999999998),
 ('Nationwide', 76630.92000000001),
 ('Navistar International', 22484.81),
 ('New York Life Insurance', 126898.91000000002),
 ('Newmont Mining', 9618.810000000001),
 ('News Corp.', 34675.03),
 ('NextEra Energy', 5321.23),
 ('Nike', 390.25),
 ('Nordstrom', 31273.019999999997),
 ('Norfolk Southern', 22100.01),
 ('Northrop Grumman', 48578.159999999996),
 ('Northwestern Mutual', 11862.92),
 ('Nucor', 60936.18000000001),
 ("O'Reilly Automotive", 9914.23),
 ('Occidental Petroleum', 105115.44),
 ('Office Depot', 51477.19),
 ('Omnicom Group', 41161.06000000001),
 ('Oneok', 2844.46),
 ('Oracle', 31231.559999999998),
 ('Owens & Minor', 13507.23),
 ('PBF Energy', 18285.93),
 ('PG&E Corp.', 81697.27),
 ('PNC Financial Services Group', 46208.37000000001),
 ('PPG Industries', 21960.88),
 ('PPL', 112176.02999999998),
 ('PVH', 10699.35),
 ('Paccar', 161294.61999999997),
 ('Pacific Life', 255319.18000000002),
 ('Parker-Hannifin', 15727.19),
 ('PayPal Holdings', 84768.93999999997),
 ('Penske Automotive Group', 26485.87),
 ('PepsiCo', 30095.72),
 ('Performance Food Group', 47645.86),
 ("Peter Kiewit Sons'", 20232.97),
 ('Pfizer', 144865.83000000002),
 ('Philip Morris International', 137600.66999999998),
 ('Phillips 66', 131173.40999999997),
 ('Plains GP Holdings', 11531.699999999999),
 ('Praxair', 19023.360000000004),
 ('Precision Castparts', 63743.89),
 ('Priceline Group', 2129.24),
 ('Principal Financial', 15177.8),
 ('Procter & Gamble', 22961.03),
 ('Progressive', 72875.83999999998),
 ('Prudential Financial', 157782.52),
 ('Public Service Enterprise Group', 73833.01),
 ('Publix Super Markets', 8364.4),
 ('Qualcomm', 54114.020000000004),
 ('R.R. Donnelley & Sons', 36218.43),
 ('Raytheon', 94725.92000000001),
 ('Reinsurance Group of America', 10264.509999999998),
 ('Reliance Steel & Aluminum', 10187.64),
 ('Republic Services', 293861.14000000013),
 ('Reynolds American', 49930.289999999986),
 ('Rite Aid', 5616.9),
 ('Ross Stores', 24961.87),
 ('Sears Holdings', 139015.09000000003),
 ('Sempra Energy', 38569.85),
 ('Sherwin-Williams', 2372.95),
 ('Sonic Automotive', 7192.13),
 ('Southern', 42881.21),
 ('Southwest Airlines', 125968.03999999996),
 ('SpartanNash', 14629.16),
 ('Stanley Black & Decker', 72788.52),
 ('Staples', 15716.26),
 ('Starbucks', 14875.19),
 ('State Farm Insurance Cos.', 111810.54999999999),
 ('State Street Corp.', 119173.59),
 ('Stryker', 4521.36),
 ('SunTrust Banks', 99125.76000000001),
 ('Supervalu', 275288.30000000005),
 ('Synnex', 134039.25),
 ('Sysco', 278575.63999999996),
 ('TIAA', 7971.509999999999),
 ('TJX', 140046.68000000002),
 ('Target', 120523.91000000003),
 ('Tech Data', 19218.88),
 ('Tenet Healthcare', 33028.08),
 ('Tenneco', 5739.630000000001),
 ('Tesoro', 14482.599999999999),
 ('Texas Instruments', 54792.72),
 ('Textron', 26339.699999999997),
 ('Thermo Fisher Scientific', 153705.1),
 ('Thrivent Financial for Lutherans', 38204.46000000001),
 ('Time Warner', 69479.05999999998),
 ('Time Warner Cable', 57130.53),
 ("Toys 'R' Us", 56179.21000000001),
 ('Travelers Cos.', 156582.24),
 ('Twenty-First Century Fox', 42065.82000000001),
 ('Tyson Foods', 47417.76),
 ('U.S. Bancorp', 26641.71),
 ('UPS', 10678.769999999999),
 ('US Foods Holding', 27074.63),
 ('USAA', 46822.63),
 ('Union Pacific', 25107.81),
 ('United Continental Holdings', 118879.76000000001),
 ('United Natural Foods', 54443.06),
 ('United States Steel', 244695.99),
 ('United Technologies', 235051.07),
 ('UnitedHealth Group', 21937.08),
 ('Univar', 16626.6),
 ('Universal Health Services', 5269.51),
 ('Unum Group', 22734.13),
 ('VF', 18251.39),
 ('Valero Energy', 52020.600000000006),
 ('Veritiv', 5735.41),
 ('Verizon', 115376.17000000001),
 ('Viacom', 33673.85999999999),
 ('Visa', 61255.49999999999),
 ('Voya Financial', 15782.23),
 ('W.W. Grainger', 8384.61),
 ('Walgreens Boots Alliance', 130153.59000000001),
 ('Walmart', 124014.87000000001),
 ('Waste Management', 10067.869999999999),
 ('WellCare Health Plans', 9743.13),
 ('Wells Fargo', 200174.66),
 ('WestRock', 13282.42),
 ('Western Digital', 269155.33999999997),
 ('Western Refining', 108579.84),
 ('Whirlpool', 32965.13),
 ('Whole Foods Market', 20240.66),
 ('World Fuel Services', 10833.11),
 ('Xcel Energy', 19975.91),
 ('Xerox', 8759.93),
 ('Yum Brands', 28296.530000000002),
 ('eBay', 94244.44000000003)]

In [78]:
%%sql
SELECT w.occurred_at, w.channel, a.name
FROM web_events w
JOIN accounts a
ON w.account_id = a.id 
ORDER BY w.occurred_at DESC
LIMIT 1;

 * sqlite:///pandp.db
Done.

[('2017-01-01 23:51:09', 'organic', 'Molina Healthcare')]

In [80]:
%%sql
SELECT w.channel, COUNT(*)
FROM web_events w
GROUP BY w.channel

 * sqlite:///pandp.db
Done.

[('adwords', 906),
 ('banner', 476),
 ('direct', 5298),
 ('facebook', 967),
 ('organic', 952),
 ('twitter', 474)]